import 'package:flutter/material.dart';

class Modelbird1 {
  String title;
  String nameeng;
  String description;
  String image;
  String food;
  String address;

  Modelbird1({
    required this.title,
    required this.nameeng,
    required this.description,
    required this.image,
    required this.food,
    required this.address,
  });
}

List<Modelbird1> birdList = [
  Modelbird1(
      title: "นกเขาไฟ",
      nameeng: "Red Collared Dove",
      description:
          "ปากอ้วน และค่อนข้างสั้ย คอสั้ย ปีกยสวแหลม หางยาวปานกลาง ขนหางคู่นอกสุดกว้างตอนปลายสีขาว ขาค่อนข้างสั้น ตัวผู้และตัวเมียสีสันแตกต่างกันเล็กน้อย ตัวผู้ปีกสีน้ำตาลแดง หัวสีเทา ขนปลายปีกสีดำ ตัวสีค่อนข้างแดง บริเวณต้นคอแถบสีดำลักษณะเป็นครึ่งวงกลมทางด้านบน ทางด้านท้ายของลำตัวด้านบนจนถึงหางเป็นสีเทา ตัวเมียคล้ายกับตัวผู้ โดยสีของลำตัวเป็นสีน้ำตาล หัวและท้ายทอยจนถึงหางเป็นสีน้ำตาลแกมเทา มีแถบที่ต้นคอเช่นเดียวกับตัวผู้ ตัวไม่เต็มวัยสีเหมือนตัวเมีย แต่ไม่มีแถบที่",
      image: ("lib/image/bird1.jpg"),
      food: "เมล็ดข้าว เมล็ดพืช แมลง ข้าว ข้าวโพด ข้างฟ่าง",
      address:"พบในอันดามัน อินเดีย ลังกา พม่า ยูนนาน จีน ไหหลำ ไต้หวัน ฟิลิปปินส์ ไทย ลาว กัมพูชา ซึ่งในประเทศไทยพบได้ทั่วไปยกเว้นภาคใต้ ชอบอาศัยอยู่ ป่าละเมาะชายทุ่ง สวน และตามทุ่งนา บางครั้งก็พบตามป่าโปร่ง ป่าเต็งรัง ป่าเบญจพรรณ",),
      
  Modelbird1(
      title: "นกเขาใหญ่",
      nameeng: "Spotted Dove",
      description:
          "นกเขาใหญ่ตัวผู้และตัวเมียมีลักษณะ คล้ายคลึงกัน บนหัวมีสีเทาและหลังสีน้ำตาลอกแดงและคอสีน้ำตาลอมแดง ลักษณะที่เด่นชัดคือ มีแถบสีดำจุดขาวคาดบริเวณคอด้านหลัง แถบดังกล่าวนี้พบทั้งตัวผู้และตัวเมีย ยกเว้นตัวที่โตไม่เต็มที่จะยังไม่ปรากฏ",
      image: ("lib/image/bird2.jpg"),
      food: "ข้าวฟ่าง และธัญพืชต่างๆ",
      address:"test",),
  Modelbird1(
      title: "นกเขาชวา",
      nameeng: "Peaceful Dove",
      description:
          "พบทั่วประเทศ พบได้ทั่วไปตามป่าโปร่ง ป่าละเมาะ ในเมือง หรือหมู่บ้าน สวนผลไม้ ทุ่งนา ทุ่งหญ้า และบริเวณที่กสิกรรมต่างๆ มีถิ่นกำเนิดในฟิลิปปินส์ และหมู่เกาะซุนดา จนถึงออสเตรเลีย ในเอเชียตะวันออกเฉียงใต้ พบในพม่า ไทย มาเลเซีย",
      image: ("lib/image/bird3.jpg"),
      food: "เมล็ดธัญพืช และเมล็ดหญ้าต่างๆ",
      address:"test",),
  Modelbird1(
      title: "นกเอี้ยงหงอน",
      nameeng: "Great Myna",
      description:
          "ขนลำตัวดำ ตาน้ำตาลแดงเข้มเกือบดำ ปากเหลือง หน้าผากมีหงอนยาวเด่นชัด ปีกมีแถบขาวเห็นเป็นวงใหญ่ขณะบิน ก้นขาว แข้งและตีนเหลือง นกวัยอ่อน หงอนสั้น ขนลำตัวแกมน้ำตาล",
      image: ("lib/image/bird4.jpg"),
      food: "แมลง ไส้เดือน เมล็ดข้าว น้าหวานจาก ดอกไม้และผลไม้สุก",
      address:"test",),
  Modelbird1(
      title: "นกเอี้ยงด่าง",
      nameeng: "Asian Pied Starling",
      description:
          "ตัวผู้และตัวเมียมีลักษณะเหมือนกัน ตัวเต็มวัยบริเวณหัว คอ คอหอย และอกตอนบนมีสีดำ มีลายแถบสีขาวที่หน้าผาก และด้านข้างของหัว ด้านบนลำตัวสีออกดำ ตะโพก และช่วงไหล่มีลายพาดสีขาว ด้านล่างลำตัวสีขาว ขนปีกด้านล่างสีขาว ตาสีขาวแกมเทา วงรอบเบ้าตาสีส้ม ปากยาวมีสีเหลืองแต่โคนปากมีสีแดงแกมส้ม ปลายสีขาว นิ้วสีเหลือง ตัวไม่เต็มวัยมีสีน้ำตาลแทนที่บริเวณที่เป็นสีดำในตัวเต็มวัย",
      image: ("lib/image/bird5.jpg"),
      food: "ปลไม้ แมลง หนอน เมล็ดพืช แมลง",
      address:"test",),
  Modelbird1(
      title: "นกเอี้ยงสาริกา",
      nameeng: "Common Myna",
      description:
          "นกเอี้ยงสาลิกาเป็นนกที่พบเห็นได้ง่ายในเขตเมืองหรือชุมชนของมนุษย์ มีความยาวประมาณ 25-26 เซนติเมตร ขาเรียวเล็ก นิ้วตีนแข็งแรง หัวและคอสีดำ ปากและหนังรอบตาสีเหลือง ลำตัวสีน้ำตาล ขอบปีกและปลายหางสีขาว หน้าอก, ท้อง และก้นสีน้ำตาลอ่อน ตัวผู้และตัวเมียคล้ายคลึงกัน หากินอยู่ตามพื้นดินปะปนกับนกชนิดอื่น ๆ มักเดินสลับวิ่งกระโดด มีความปราดเปรียว ชอบจิกตีต่อสู้กันเองหรือทะเลาะวิวาทกับนกชนิดอื่น",
      image: ("lib/image/bird6.jpg"),
      food: "แมลง ตัวหนอน สัตว์ขนาดเล็ก ธัญพืช",
      address:"test",),
  Modelbird1(
      title: "นกกินปลี คอสีน้ำตาล",
      nameeng: "Brown-throated sunbird",
      description:
          "ตัวผู้ : หัวถึงหลังตอนบนเขียวเข้มเหลือบเป็นมัน ข้างแก้มและคอน้ำตาล กลางคอจางหรือแกมขาวกว่าส่วนอื่น แถบหนวดและไหล่ม่วงเหลือบเป็นมัน โคนปีกน้ำตาลแดง ตะโพกน้ำเงินแกมม่วงเหลือบเป็นมัน หางเขียวคล้ำ ลำตัวด้านล่างเหลืองเข้ม ตัวเมีย : ขนาดใหญ่กว่านกกินปลีเปลือกเหลือง ลำตัวด้านบนเหลืองแกมเขียว ลำตัวด้านล่างเหลืองเข้ม เหนือตาและใต้ตามีเส้นเหลืองอ่อนคล้ายวงตาแต่ไม่ต่อเนื่องกัน ",
      image: ("lib/image/bird7.jpg"),
      food: "แมลง",
      address:"test",),
  Modelbird1(
      title: "นกกินปลี อกสีเหลือง",
      nameeng: "Olive-backed sunbird",
      description:
          "ตัวผู้ หัว และลำตัวด้านบนสีเขียวแกมเหลือง คอ และอกส่วนบนสีน้ำเงินเหลือบต่อด้วยแถบแคบ ๆ สีน้ำตาลแกมแดง และล่างสุดเป็นแถบสีดำแคบ ๆ ท้อง และขนคลุมโคนหางด้านล่างสีเหลืองสด ข้างอกมีกระจุกขนสีส้ม แต่มักซ่อนอยู่ใต้ปีก และสังเกตุเห็นได้ยาก ตัวเมีย มีคิ้วสีเหลืองจาง ๆ หัว และลำตัวด้านบนสีเขียวแกมเหลือง หางสีดำ ลำตัวด้านล่างสีเหลืองสด อาศัยอยู่ตามป่าโปร่ง ชายป่า สวนสาธารณะ สวนป่า ส่งเสียงร้อง “วี่ วี วี้ดด” นกประจำถิ่น พบบ่อยมาก",
      image: ("lib/image/bird88.jpg"),
      food: "น้ำต้อย",
      address:"test",),
  Modelbird1(
      title: "นกสีชมพูสวน",
      nameeng: "𝘋𝘪𝘤𝘢𝘦𝘶𝘮 𝘤𝘳𝘶𝘦𝘯𝘵𝘢𝘵𝘶𝘮",
      description:
          "เป็นนกขนาดเล็ก ความยาว (ปลายปากถึงหาง) ประมาณ 9 เซนติเมตร มีเสียงร้อง แหลมสูง และ สั้น บางครั้งฟังเหมือน เสียงร้องคำว่า ดิ๊กๆ ตามลำตัวมีสามสี ถ้าเป็นตัวผู้จะสังเกตได้ง่าย จากสีที่กลางหลัง เพราะเป็นแถบยาวสีแดง ส่วนด้านท้องจะเป็นสีขาว และข้าง ๆ เป็นสีดำ - น้ำตาล ส่วนตัวเมียมีสีอ่อนกว่า และแถบสีแดงด้านหลังจะสั้นกว่า มีอยู่บริเวณโคนหางเท่านั้น นกชนิดนี้มีลักษณะ ป้อม และหางสั้น วัยเด็ก (Juvenile) ยังไม่มีสีแดงที่ด้านหลัง และสีอ่อนกว่าวัยโตสามารถพบเห็นได้ง่ายในประเทศไทย",
      image: ("lib/image/bird99.jpg"),
      food: "น้ำหวานและผลไม้จากต้นไม้ตระกูลกาฝาก",
      address:"test",),
  Modelbird1(
      title: "นกกาเหว่า",
      nameeng: "Western Koel",
      description:
          "นกกาเหว่าเป็นนกในวงศ์คัคคู (Cuculidae) มีขนาดใกล้เคียงกับอีกา ลำตัวเพรียวยาว ตาสีแดง หางยาวและแข็ง เท้าจับกิ่งไม้มีลักษณะพิเศษต่างจากนกชนิดอื่น คือสามารถจับกิ่งไม้ได้รอบโดยใช้นิ้วหน้า 2 นิ้ว และนิ้วหลัง 2 นิ้ว ตัวผู้มีสีดำ ปากสีเขียวเทา ส่วนตัวเมียสีน้ำตาลแก่ มีลายเป็นจุดขาวทั่วตัว",
      image: ("lib/image/bird1010.jpg"),
      food: "งูบางชนิด กิ้งก่า จิ้งเหลน กบ เขียด นกเล็ก ๆ และผลไม้บางชนิด",
      address:"test",),
  Modelbird1(
      title: "นกกิ้งโครงคอดำ",
      nameeng: "Black-collared Starling",
      description:
          "เป็นนกจำพวกนกเอี้ยง ขนาดค่อนข้างใหญ่กว่าชนิดอื่น ตัวผู้และตัวเมียมีลักษณะคล้ายกัน ขนบนหลังและปีกมีสีเทาเข้มแต้มด้วยรอยขีดสีขาว บนหัว อกและด้านใต้เป็นสีขาว บริเวณคอมีคาดสีดำเป็นแถบขนาดใหญ่ แต่นกตัวที่ยังไม่โตเต็มที่ไม่มีแถบสีดำนี้",
      image: ("lib/image/bird11.jpg"),
      food: "เมล็ดพืช แมลง สัตว์เลื้อยคลานขนาดเล็ก",
      address:"test",),
  Modelbird1(
      title: "นกปรอดหน้านวล",
      nameeng: "Yellow-vented Bulbul",
      description:
          "ตัวเต็มวัยด้านบนลำตัวสีน้ำตาล บริเวณหัวตาสีดำ มีคิ้วสีขาว อกมีสีน้ำตาลแซม ขนคลุมโคนขนหางด้านล่างสีเหลืองแกมเขียว ตัวไม่เต็มวัยคิ้วสีออกเทา",
      image: ("lib/image/bird12.jpg"),
      food: "ปลไม้ ตัวหนอน และแมลงต่าง ๆ",
      address:"test",),
  Modelbird1(
      title: "นกตีทอง",
      nameeng: "Coppersmith Barbet",
      description:
          "ตัวผู้และตัวเมียมีลักษณะคล้ายกัน ขนด้านบนตัวมีสีเขียวสด หน้าอกมีแถบสีแดง และด้านใต้ตัวมีลายสีเขียวขนาดเล็ก คอเป็นสีเหลือง รอบตามีสีเหลืองและบนหัวมีแถบสีแดง ปากมีสีดำและมีขนแข็ง นกโตไม่เต็มวัยไม่มีสีแดงที่หน้าผาก",
      image: ("lib/image/bird1313.jpg"),
      food: "กินเมล็ดพืช ผลไม้และแมลงบางชนิดเป็นอาหาร",
      address:"test",),
  Modelbird1(
      title: "นกกระจอกบ้าน",
      nameeng: "Eurasian Tree Sparrow",
      description:
          "ตัวเต็มวัย ปากสีดำ หน้า และใต้คอสีดำ บริเวณแก้มสีขาว แต้มสีดำ กระหม่อมสี้น้ำตาลเข้ม มีวงรอบคอแคบ ๆ สีขาว อก และท้องสีเทา สีข้างสีน้ำตาลอ่อน หลังสีน้ำตาลมีลายขีดหนาสีดำแทรก ปีกสีน้ำตาลแกมแดง มีแถบปีกสองแถบสีขาว อาศัยอยู่ตามแหล่งชุมชน ทุ่งนา ทุ่งโล่ง พื้นที่เกษตรกรรม ส่งเสียง “”ชิบ ชิบ ชิบ” ติดต่อกัน นกประจำถิ่น พบบ่อยมาก",
      image: ("lib/image/bird14.jpg"),
      food: "กินได้หลายอย่าง เช่น อาหารนก แอปเปิ้ล กล้วย ฝรั่ง แคนตาลูป",
      address:"test",),
  Modelbird1(
      title: "นกกระจอกใหญ่",
      nameeng: "House Sparrow",
      description:
          "ตัวผู้ กระหม่อม ลำตัวด้านล่าง และตะโพกสีเทา คอ อก และแถบคาดตาสีดำ มีแถบหนาสีน้ำตาลแกมแดงลากจากท้ายตาถึงข้างหัว แถ้มสีขาว ปีก และหลังสีน้ำตาลแกมแดงมีลายขีดสีดำแทรก หางสีน้ำตาลเข้มเกือบดำ ขอบขนหางสีจาง ตัวเมีย คล้ายนกกระจอกตาลตัวเมีย ลำตัวด้านล่างสีน้ำตาลแกมเหลือง หลังมีลายขีดสีดำ อาศัยอยู่ตามทุ่งโล่ง นาข้าว เขตชุมชน พื้นที่เกษตรกรรม บางครั้งพบเป็นฝูงใหญ่หากินปะปนกับนกกินเมล็ดพืชอื่น ๆ ในทุ่งนา นกประจำถิ่น พบบ่อย",
      image: ("lib/image/bird15.jpg"),
      food: "กินเมล็ดพืช",
      address:"test",),
  Modelbird1(
      title: "อีกา",
      nameeng: "jungle crow",
      description:
          "ลำตัวค่อนข้างหนา ปากใหญ่หนาสีดำ สันปากบนโป่งโค้ง บริเวณจมูกและโคนปากมีขนละเอียดแข็งปกคลุม ทั่วทั้งลำตัวสีดำ มีสีเหลือบบริเวณลำตัวด้านบนและหาง ขณะบินปีกค่อนข้างกว้าง ขนปลายปีกแยกออกลักษณะคล้ายนิ้วมือ ซึ่งอาจจะทำให้สับสนกับเหยี่ยวชนิดต่าง ๆ เมื่อมองจากระยะไกล อย่างไรก็ตามหัวเล็ก หางยาว ปลายหางมน อาศัยอยู่ได้ในสภาพพื้นที่หลายแบบ ตั้งแต่ชายป่า ป่าโปร่ง สวนป่า พื้นที่เกษตร สวนสาธารณะในเมืองหรือแหล่งชุมชน มักพบเป็นฝูง บางครั้งนกกินซากสัตว์บนท้องถนน นกประจำถิ่น พบบ่อย",
      image: ("lib/image/bird16.jpg"),
      food: "แมลง ตัวหนอน ไข่ ลูกนก กบ เขียด กิ้งก่า แย้ และซากสัตว์",
      address:"test",),
  Modelbird1(
      title: "นกตะขามทุ่ง",
      nameeng: "Indian Roller",
      description:
          "ตัวผู้และตัวเมียมีลักษณะเหมือนกัน ขนบนกระหม่อมมีสีเขียวแกมฟ้า เหลือง และน้ำตาล บริเวณคอ ไหล่ อก และหลังเป็นสีน้ำตาลแกมเขียว ปีกสีน้ำเงินแกมม่วง หางมีสีฟ้าคาดด้วยแถบสีน้ำเงิน บริเวณใต้ท้องและปีกเมื่อบินจะเห็นสีฟ้าสดแกมเขียว ปากหนาเรียวปลายแหลม และคอสั้น",
      image: ("lib/image/bird17.jpg"),
      food:
          "นกตะขาบทุ่งกินทั้งแมลง หนอน ไส้เดือน ลูกกบ เขียด สัตว์เลือยคลาน และสัตว์เล็ก ๆ",
      address:"test",),
  Modelbird1(
      title: "นกปากห่าง",
      nameeng: "Asian Openbill",
      description:
          "เป็นนกกระสาขนาดใหญ่ หัวกลม คอขาว ขายาว ปากยาวสีน้ำตาลอมเหลือง ปากบนกับปากล่างไม่สบกันตรงกลางจนเกิดเป็นช่องว่าง หัว คอ หลัง อก ท้อง และหัวไหล่สีขาวอมเหลือง ตัดกับขนโคนปีก ขนกลาง ปีกสีดำ ขนปลายปีกและหางสีดำ แข้งและตีนสีชมพูอ่อน นกวัยอ่อน หัว คอ อก สีน้ำตาลอ่อน แข้งสีคล้ำ พบได้บ่อย อาศัยอยู่ตามพื้นที่ชุ่มน้ำ หนอง คลอง บึง ทุ่งนา บางครั้งพบเป็นฝูงใหญ่เดินหาเหยื่อตามแหล่งน้ำ โดยเฉพาะหอยเชอรี่",
      image: ("lib/image/bird18.jpg"),
      food: "หอยโข่งและหอยเชอรี่ รวมทั้งสัตว์น้ำต่างๆ",
      address:"test",),
  Modelbird1(
      title: "นกปรอดสวน",
      nameeng: "Streak-eared Bulbul",
      description:
          "ขนคลุมหูมีสีขาวแกมเทาชัดเจน ตาสีเทา มีลายขีดสีขาวบริเวณหู และมักจะเด่นชัดกว่า ปีกสีเขรยว ขนคลุมโคนหางด้านล่างสีเหลืองอ่อน",
      image: ("lib/image/bird19.jpg"),
      food:
          "ผลไม้ต่าง ๆ เช่น ไทร หว้าชมพู่ มะละกอ มะม่วง ผลตำลึงสุก แมลง หนอน",
      address:"test",),
  Modelbird1(
      title: "นกพิราบป่า",
      nameeng: "Rock Pigeon",
      description:
          "นกขนาดกลางที่มีทั้งประชากรดั้งเดิมและประชากรต่างถิ่นกระจายอยู่ทั่วโลก ประชากรดั้งเดิมตามธรรมชาติทำรังวางไข่บนหน้าผาหินและถ้ำทางตะวันตกของยุโรปไปจนถึงเอเชียกลาง ลำตัวโดยรวมสีเทาอ่อน มีแถบหนาสีดำสองแถบบนปีก คอมีปื้นสีเหลือบเขียวและม่วง ประชากรต่างถิ่นพบได้ทั่วไปทั้งในเมืองและพื้นที่เกษตรกรรม มักอาศัยรวมกันเป็นฝูงใหญ่ มีชุดขนที่หลากหลายมาก บางตัวอาจมีชุดขนเหมือนกับนกป่าดั้งเดิม แต่ก็อาจมีทั้งชุดขนสีดำ ขาว น้ำตาลแดง หรือทุกสีปะปนได้เช่นกัน",
      image: ("lib/image/bird20.jpg"),
      food: "กินเมล็ดพืชเป็นหลัก",
      address:"test",),
];
